{
    "sources": {
        "data": {
            "url": "https://public-data.telemetry.mozilla.org/prod/usage_report_data/v1/master/webusage.json",
            "format": "quantum"
        },
        "annotations": {
            "url": "https://public-data.telemetry.mozilla.org/prod/usage_report_data/v1/master/annotations_webusage.json"
        }
    },
    "extraMetadata": {
        "title": "Usage Behavior",
        "description": "Usage Behavior is a weekly report describing ways in which desktop users are interacting with the web.",
        "defaultCategory": "Worldwide",
        "metrics": {
            "locale": {
                "title": "Top Languages",
                "description": [
                    "Top Languages shows the distribution of the top 5 language settings for Firefox Desktop.",
                    "Worldwide, English (US) remains the most common, at about 40% of the population, with German (11%) and French (6.5%) coming 2^nd^ and 3^rd^. Russian and Spanish (Spain) are the 4^th^ and 5^th^ most common languages, with around 5% of the population each.",
                    "For most countries in the top 10, the majority (>90%) of users have their language set to the local language, with a notable exception in Indonesia, which has about 80% English (US) and 20% Indonesian."
                ],
                "type": "line",
                "axes": {
                    "y": {
                        "unit": "%"
                    }
                }
            },
            "pct_TP": {
                "title": "Always On Tracking Protection",
                "description": [
                    "Always On Tracking Protection shows the percentage of Firefox Desktop clients with Tracking Protection enabled for all browsing sessions.",
                    "Tracking Protection is a feature which blocks sites from tracking users across multiple websites, adding a layer of privacy to browsing. This feature is on by default in Private Browsing sessions, but starting in FF57, we gave users the option to [enable this feature for all browsing sessions](https://support.mozilla.org/kb/tracking-protection).",
                    "Note: This is only the percentage of users with Always On Tracking Protection and does not include Tracking Protection use in Private Browsing."
                ],
                "type": "line",
                "axes": {
                    "y": {
                        "unit": "%"
                    }
                }
            },
            "pct_addon": {
                "title": "Has Add-on",
                "description": [
                    "Has Add-on shows the percentage of Firefox Desktop clients with user installed add-ons.",
                    "One of the best things about Firefox is the robust add-on community which gives users the option to customize and control their browsing experience. Our users agree, with over a third of Firefox users having at least 1 installed add-on.",
                    "This metric varies globally. On one end is China and Brazil, where 20% and 18% have add-ons, respectively. On the other is Russia, where almost 60% of users have add-ons."
                ],
                "type": "line",
                "axes": {
                    "y": {
                        "unit": "%"
                    }
                }
            },
            "top10addons": {
                "title": "Top Add-ons",
                "description": [
                    "Top Add-ons shows the top 10 most popular Firefox Desktop add-ons for a week.",
                    "Overall, the most popular add-ons are ad-blockers, coming in first in almost all of the top 10 countries. Ad-blocking seems particularly popular in Germany and France, with 4 of the top 10 add-ons being ad-blockers in France."
                ],
                "type": "table",
                "columns": [
                    {
                        "name": "Add-on"
                    },
                    {
                        "name": "Usage",
                        "unit": "%"
                    }
                ]
            }
        },
        "dashboard": {
            "sectioned": false,
            "metrics": [
                "locale",
                "pct_TP",
                "pct_addon",
                "top10addons"
            ]
        }
    }
}
